### Terraform Plan - `dev` Environment

<details>
<summary>Show Plan</summary>

```terraform
random_string.kv_suffix: Refreshing state... [id=7j51clw8]
random_string.appgw_suffix: Refreshing state... [id=u02liakq]
random_string.storage_suffix: Refreshing state... [id=b5xxtm3i]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01NjQwMDBmNi05NDQ3LTQ2OTktYjg3ZS1iZWIzZDA1MjliYzQ7b2JqZWN0SWQ9MTg3ZjEwMTgtZWVhNi00YWU4LWJiMWItOGNjN2ZlYzFkNWM5O3N1YnNjcmlwdGlvbklkPWRjMjJkNmQ4LTA0OTUtNDY1My1hNjliLWVkZmUxNjg0MGY4ZTt0ZW5hbnRJZD02MWE4NzQ2ZS00MjRkLTQxMDUtYTA1NC1iMzg1NzNkNmU1NGE=]
azurerm_service_plan.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/serverFarms/chatops-app-plan]
azurerm_monitor_action_group.security_alerts: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/security-alerts]
azurerm_public_ip.appgw: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/publicIPAddresses/chatops-appgw-pip]
azurerm_network_watcher.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkWatchers/chatops-network-watcher]
azurerm_network_security_group.gateway_nsg: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/gateway-nsg]
azurerm_web_application_firewall_policy.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/chatops-waf-policy]
azurerm_monitor_action_group.ops_alerts: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts]
azurerm_network_security_group.app_nsg: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg]
azurerm_storage_account.nsg_flow_logs: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i]
azurerm_log_analytics_workspace.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.OperationalInsights/workspaces/chatops-loganalytics]
azurerm_user_assigned_identity.nsg_flow_logs: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/nsg-flow-logs-identity]
azurerm_virtual_network.chatops_vnet: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet]
azurerm_user_assigned_identity.appgw: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/chatops-appgw-identity]
azurerm_network_security_rule.allow_https_inbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/gateway-nsg/securityRules/AllowHTTPSInbound]
azurerm_network_security_rule.allow_gateway_manager: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/gateway-nsg/securityRules/AllowGatewayManager]
azurerm_network_security_rule.deny_all_inbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg/securityRules/DenyAllInbound]
azurerm_network_security_rule.allow_gateway_inbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg/securityRules/AllowGatewayInbound]
azurerm_network_security_rule.allow_internet_outbound: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/networkSecurityGroups/app-nsg/securityRules/AllowInternetOutbound]
azurerm_subnet.gateway_subnet: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/gateway-subnet]
azurerm_subnet.app_subnet: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet]
azurerm_monitor_scheduled_query_rules_alert_v2.kv_failed_auth: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/kv-failed-authentication-alert]
azurerm_application_insights.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/components/chatops-appinsights]
azurerm_monitor_scheduled_query_rules_alert_v2.kv_secret_access_anomaly: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/kv-secret-access-anomaly-alert]
azurerm_monitor_scheduled_query_rules_alert_v2.kv_secret_expiration: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/kv-secret-expiration-alert]
azurerm_subnet_network_security_group_association.gateway_nsg_assoc: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/gateway-subnet]
azurerm_subnet_network_security_group_association.app_nsg_assoc: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet]
azurerm_key_vault.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8]
azurerm_key_vault_secret.github_webhook_secret: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/github-webhook-secret/c38ad3dabaa641a6bb95509192603d5b]
azurerm_key_vault_secret.bot_app_id: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/bot-app-id/ddcab9583fe546a58b29ee30ace31f78]
azurerm_role_assignment.appgw_kv_secrets_user: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8/providers/Microsoft.Authorization/roleAssignments/52b05056-9fb9-81a4-57ff-882c076fca65]
azurerm_key_vault_secret.github_app_private_key: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/github-app-private-key/0c059973e36441789f8c2c66d36f3572]
azurerm_monitor_diagnostic_setting.kv_diagnostics: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8|kv-diagnostics]
azurerm_key_vault_secret.github_app_id: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/github-app-id/d72bc82dcf674d5f855557e87753f33b]
azurerm_key_vault_secret.bot_app_password: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/bot-app-password/9eca0b2ba5184787a66a774bd0f26afa]
azurerm_key_vault_secret.entra_client_secret: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/entra-client-secret/e35620c27c2246448225265dc042680b]
azurerm_linux_web_app.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service]
azurerm_monitor_scheduled_query_rules_alert_v2.failed_dependency: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/failed-dependency]
azurerm_application_insights_standard_web_test.chatops_westus: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-westus]
azurerm_application_insights_standard_web_test.chatops_northeurope: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-northeurope]
azurerm_monitor_scheduled_query_rules_alert_v2.availability_test_failure: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/availability-test-failure]
azurerm_application_insights_standard_web_test.chatops_eastus: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-eastus]
azurerm_application_insights_standard_web_test.chatops_australiaeast: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-australiaeast]
azurerm_key_vault_secret.appinsights_connection_string: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/secrets/appinsights-connection-string/646c2e5acd6c452f85260e74591cc5fb]
azurerm_monitor_scheduled_query_rules_alert_v2.slow_response_time: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/slow-response-time]
azurerm_application_insights_standard_web_test.chatops_southeastasia: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-southeastasia]
azurerm_monitor_scheduled_query_rules_alert_v2.high_exception_rate: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/high-exception-rate]
azurerm_role_assignment.kv_secrets_user_app_service: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8/providers/Microsoft.Authorization/roleAssignments/b78214a8-1f48-f6e0-a32d-0748f9893376]
azurerm_app_service_virtual_network_swift_connection.chatops: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service/config/virtualNetwork]
azurerm_monitor_diagnostic_setting.app_service: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service|app-service-diagnostics]
azurerm_key_vault_certificate.appgw_ssl: Refreshing state... [id=https://chatops-kv-7j51clw8.vault.azure.net/certificates/appgw-ssl-cert/c7a3b8bf8f664306aa21b7196e0eee2e]
azurerm_role_assignment.terraform_storage_access: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i/providers/Microsoft.Authorization/roleAssignments/2e56668e-b83a-d1b7-8a27-6c15b56ca283]
azurerm_role_assignment.flow_logs_storage: Refreshing state... [id=/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i/providers/Microsoft.Authorization/roleAssignments/65c90aa2-911a-b1ce-443f-09efb50ec550]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_linux_web_app.chatops has been deleted
  - resource "azurerm_linux_web_app" "chatops" {
      - default_hostname                               = "chatops-app-service.azurewebsites.net" -> null
      - id                                             = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/sites/chatops-app-service" -> null
      - name                                           = "chatops-app-service" -> null
        tags                                           = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
        }
        # (20 unchanged attributes hidden)

      - identity {
          - principal_id = "1c83a1d0-b6ae-470d-9bde-cf0ed5fb3400" -> null
          - tenant_id    = "61a8746e-424d-4105-a054-b38573d6e54a" -> null
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_public_ip.appgw has changed
  ~ resource "azurerm_public_ip" "appgw" {
      ~ fqdn                    = "chatops-appgw-u02liakq.eastus.cloudapp.azure.com" -> "chatops-appgw-kpzapfzq.eastus.cloudapp.azure.com"
        id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/publicIPAddresses/chatops-appgw-pip"
        name                    = "chatops-appgw-pip"
        tags                    = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
            "Purpose"     = "Application Gateway Public IP"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_service_plan.chatops has been deleted
  - resource "azurerm_service_plan" "chatops" {
      - id                           = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Web/serverFarms/chatops-app-plan" -> null
      - name                         = "chatops-app-plan" -> null
        tags                         = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-Team"
        }
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # azurerm_app_service_virtual_network_swift_connection.chatops will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "chatops" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_application_insights.chatops will be updated in-place
  ~ resource "azurerm_application_insights" "chatops" {
        id                                    = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/components/chatops-appinsights"
        name                                  = "chatops-appinsights"
      ~ tags                                  = {
            "Application" = "ChatOps"
          ~ "CostCenter"  = "IT-Operations" -> "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
          ~ "Owner"       = "ChatOps-Team" -> "ChatOps-DevTeam"
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_application_insights_standard_web_test.chatops_australiaeast will be updated in-place
  ~ resource "azurerm_application_insights_standard_web_test" "chatops_australiaeast" {
        id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-australiaeast"
        name                    = "chatops-availability-australiaeast"
      ~ tags                    = {
            "Application" = "ChatOps"
          ~ "CostCenter"  = "IT-Operations" -> "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
          ~ "Owner"       = "ChatOps-Team" -> "ChatOps-DevTeam"
            "TestRegion"  = "australiaeast"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_application_insights_standard_web_test.chatops_eastus will be updated in-place
  ~ resource "azurerm_application_insights_standard_web_test" "chatops_eastus" {
        id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-eastus"
        name                    = "chatops-availability-eastus"
      ~ tags                    = {
            "Application" = "ChatOps"
          ~ "CostCenter"  = "IT-Operations" -> "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
          ~ "Owner"       = "ChatOps-Team" -> "ChatOps-DevTeam"
            "TestRegion"  = "eastus"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_application_insights_standard_web_test.chatops_northeurope will be updated in-place
  ~ resource "azurerm_application_insights_standard_web_test" "chatops_northeurope" {
        id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-northeurope"
        name                    = "chatops-availability-northeurope"
      ~ tags                    = {
            "Application" = "ChatOps"
          ~ "CostCenter"  = "IT-Operations" -> "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
          ~ "Owner"       = "ChatOps-Team" -> "ChatOps-DevTeam"
            "TestRegion"  = "northeurope"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_application_insights_standard_web_test.chatops_southeastasia will be updated in-place
  ~ resource "azurerm_application_insights_standard_web_test" "chatops_southeastasia" {
        id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-southeastasia"
        name                    = "chatops-availability-southeastasia"
      ~ tags                    = {
            "Application" = "ChatOps"
          ~ "CostCenter"  = "IT-Operations" -> "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
          ~ "Owner"       = "ChatOps-Team" -> "ChatOps-DevTeam"
            "TestRegion"  = "southeastasia"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_application_insights_standard_web_test.chatops_westus will be updated in-place
  ~ resource "azurerm_application_insights_standard_web_test" "chatops_westus" {
        id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/webTests/chatops-availability-westus"
        name                    = "chatops-availability-westus"
      ~ tags                    = {
            "Application" = "ChatOps"
          ~ "CostCenter"  = "IT-Operations" -> "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
          ~ "Owner"       = "ChatOps-Team" -> "ChatOps-DevTeam"
            "TestRegion"  = "westus"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_key_vault.chatops will be updated in-place
  ~ resource "azurerm_key_vault" "chatops" {
        id                              = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8"
        name                            = "chatops-kv-7j51clw8"
      ~ public_network_access_enabled   = false -> true
        tags                            = {
            "Application" = "ChatOps"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
        }
        # (12 unchanged attributes hidden)

      ~ network_acls {
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_key_vault_secret.redis_access_key will be created
  + resource "azurerm_key_vault_secret" "redis_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8"
      + name                    = "redis-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-DevTeam"
          + "SecretType"  = "AccessKey"
          + "Service"     = "Redis"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_host will be created
  + resource "azurerm_key_vault_secret" "redis_host" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8"
      + name                    = "redis-host"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-DevTeam"
          + "SecretType"  = "ConnectionString"
          + "Service"     = "Redis"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_port will be created
  + resource "azurerm_key_vault_secret" "redis_port" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8"
      + name                    = "redis-port"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-DevTeam"
          + "SecretType"  = "Configuration"
          + "Service"     = "Redis"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_web_app.chatops will be created
  + resource "azurerm_linux_web_app" "chatops" {
      + app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive value)
          + "AZURE_CLIENT_ID"                            = ""
          + "ApplicationInsightsAgent_EXTENSION_VERSION" = "~3"
          + "BOT_APP_ID"                                 = "@Microsoft.KeyVault(VaultName=chatops-kv-7j51clw8;SecretName=bot-app-id)"
          + "BOT_APP_PASSWORD"                           = "@Microsoft.KeyVault(VaultName=chatops-kv-7j51clw8;SecretName=bot-app-password)"
          + "GITHUB_WEBHOOK_SECRET"                      = "@Microsoft.KeyVault(VaultName=chatops-kv-7j51clw8;SecretName=github-webhook-secret)"
          + "REDIS_HOST"                                 = "@Microsoft.KeyVault(VaultName=chatops-kv-7j51clw8;SecretName=redis-host)"
          + "REDIS_PASSWORD"                             = "@Microsoft.KeyVault(VaultName=chatops-kv-7j51clw8;SecretName=redis-access-key)"
          + "REDIS_PORT"                                 = "@Microsoft.KeyVault(VaultName=chatops-kv-7j51clw8;SecretName=redis-port)"
          + "REDIS_TLS"                                  = "true"
          + "WEBSITE_RUN_FROM_PACKAGE"                   = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "chatops-app-service"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-chatops-dev"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations-Dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-DevTeam"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = false
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 5
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }

          + ip_restriction {
              + action     = "Allow"
              + ip_address = "10.0.2.0/24"
              + name       = "AllowApplicationGateway"
              + priority   = 100
            }
          + ip_restriction {
              + action     = "Deny"
              + ip_address = "0.0.0.0/0"
              + name       = "DenyAll"
              + priority   = 2147483647
            }
        }
    }

  # azurerm_monitor_diagnostic_setting.app_service will be created
  + resource "azurerm_monitor_diagnostic_setting" "app_service" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.OperationalInsights/workspaces/chatops-loganalytics"
      + name                           = "app-service-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AppServiceAppLogs"
        }
      + enabled_log {
          + category = "AppServiceAuditLogs"
        }
      + enabled_log {
          + category = "AppServiceConsoleLogs"
        }
      + enabled_log {
          + category = "AppServiceHTTPLogs"
        }
      + enabled_log {
          + category = "AppServiceIPSecAuditLogs"
        }
      + enabled_log {
          + category = "AppServicePlatformLogs"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_monitor_diagnostic_setting.redis will be created
  + resource "azurerm_monitor_diagnostic_setting" "redis" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.OperationalInsights/workspaces/chatops-loganalytics"
      + name                           = "redis-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "ConnectedClientList"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_monitor_metric_alert.redis_connection_errors will be created
  + resource "azurerm_monitor_metric_alert" "redis_connection_errors" {
      + auto_mitigate            = true
      + description              = "Alert when more than 5 connection errors occur within 5 minutes, indicating potential connectivity issues."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "redis-connection-errors"
      + resource_group_name      = "rg-chatops-dev"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations-Dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-DevTeam"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "errors"
          + metric_namespace       = "Microsoft.Cache/redis"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 5

          + dimension {
              + name     = "ErrorType"
              + operator = "Include"
              + values   = [
                  + "ConnectionError",
                ]
            }
        }
    }

  # azurerm_monitor_metric_alert.redis_high_cache_miss_rate will be created
  + resource "azurerm_monitor_metric_alert" "redis_high_cache_miss_rate" {
      + auto_mitigate            = true
      + description              = "Alert when cache miss rate exceeds 50% for 10 minutes, indicating inefficient caching patterns."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "redis-high-cache-miss-rate"
      + resource_group_name      = "rg-chatops-dev"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations-Dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-DevTeam"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cachemissrate"
          + metric_namespace       = "Microsoft.Cache/redis"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 50
        }
    }

  # azurerm_monitor_metric_alert.redis_high_memory_usage will be created
  + resource "azurerm_monitor_metric_alert" "redis_high_memory_usage" {
      + auto_mitigate            = true
      + description              = "Alert when Redis memory usage exceeds 90%, indicating potential memory pressure."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "redis-high-memory-usage"
      + resource_group_name      = "rg-chatops-dev"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations-Dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-DevTeam"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "usedmemorypercentage"
          + metric_namespace       = "Microsoft.Cache/redis"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 90
        }
    }

  # azurerm_monitor_metric_alert.redis_high_server_load will be created
  + resource "azurerm_monitor_metric_alert" "redis_high_server_load" {
      + auto_mitigate            = true
      + description              = "Alert when Redis server load exceeds 90% for 5 minutes, indicating potential performance issues."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "redis-high-server-load"
      + resource_group_name      = "rg-chatops-dev"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations-Dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-DevTeam"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/actionGroups/ops-alerts"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "serverLoad"
          + metric_namespace       = "Microsoft.Cache/redis"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 90
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.availability_test_failure will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "availability_test_failure" {
        id                                     = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/availability-test-failure"
        name                                   = "availability-test-failure"
      ~ tags                                   = {
            "Application" = "ChatOps"
          ~ "CostCenter"  = "IT-Operations" -> "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
          ~ "Owner"       = "ChatOps-Team" -> "ChatOps-DevTeam"
        }
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.failed_dependency will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "failed_dependency" {
        id                                     = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/failed-dependency"
        name                                   = "failed-dependency"
      ~ tags                                   = {
            "Application" = "ChatOps"
          ~ "CostCenter"  = "IT-Operations" -> "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
          ~ "Owner"       = "ChatOps-Team" -> "ChatOps-DevTeam"
        }
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.high_exception_rate will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "high_exception_rate" {
        id                                     = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/high-exception-rate"
        name                                   = "high-exception-rate"
      ~ tags                                   = {
            "Application" = "ChatOps"
          ~ "CostCenter"  = "IT-Operations" -> "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
          ~ "Owner"       = "ChatOps-Team" -> "ChatOps-DevTeam"
        }
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.slow_response_time will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "slow_response_time" {
        id                                     = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Insights/scheduledQueryRules/slow-response-time"
        name                                   = "slow-response-time"
      ~ tags                                   = {
            "Application" = "ChatOps"
          ~ "CostCenter"  = "IT-Operations" -> "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
          ~ "Owner"       = "ChatOps-Team" -> "ChatOps-DevTeam"
        }
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_network_security_group.github_runners_nsg will be created
  + resource "azurerm_network_security_group" "github_runners_nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "github-runners-nsg-dev"
      + resource_group_name = "rg-chatops-dev"
      + security_rule       = (known after apply)
      + tags                = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Purpose"     = "GitHub Runners"
        }
    }

  # azurerm_network_security_rule.github_runners_allow_azure_https will be created
  + resource "azurerm_network_security_rule" "github_runners_allow_azure_https" {
      + access                      = "Allow"
      + description                 = "Allow HTTPS to Azure services (Key Vault, Storage, Container Registry)"
      + destination_address_prefix  = "AzureCloud"
      + destination_port_range      = "443"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowAzureServicesHTTPS"
      + network_security_group_name = "github-runners-nsg-dev"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.github_runners_allow_dns will be created
  + resource "azurerm_network_security_rule" "github_runners_allow_dns" {
      + access                      = "Allow"
      + description                 = "Allow DNS queries to Azure DNS"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_range      = "53"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowDNS"
      + network_security_group_name = "github-runners-nsg-dev"
      + priority                    = 120
      + protocol                    = "Udp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.github_runners_allow_github_https will be created
  + resource "azurerm_network_security_rule" "github_runners_allow_github_https" {
      + access                      = "Allow"
      + description                 = "Allow HTTPS to GitHub (api.github.com, github.com, *.actions.githubusercontent.com)"
      + destination_address_prefix  = "Internet"
      + destination_port_range      = "443"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowGitHubHTTPS"
      + network_security_group_name = "github-runners-nsg-dev"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.github_runners_deny_all_inbound will be created
  + resource "azurerm_network_security_rule" "github_runners_deny_all_inbound" {
      + access                      = "Deny"
      + description                 = "Deny all inbound traffic"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "github-runners-nsg-dev"
      + priority                    = 4000
      + protocol                    = "*"
      + resource_group_name         = "rg-chatops-dev"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_public_ip.appgw will be updated in-place
  ~ resource "azurerm_public_ip" "appgw" {
      ~ domain_name_label       = "chatops-appgw-kpzapfzq" -> "chatops-appgw-u02liakq"
        id                      = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/publicIPAddresses/chatops-appgw-pip"
        name                    = "chatops-appgw-pip"
        tags                    = {
            "Application" = "ChatOps"
            "CostCenter"  = "IT-Operations-Dev"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "ChatOps-DevTeam"
            "Purpose"     = "Application Gateway Public IP"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_redis_cache.chatops will be created
  + resource "azurerm_redis_cache" "chatops" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + minimum_tls_version           = "1.2"
      + name                          = (known after apply)
      + non_ssl_port_enabled          = (known after apply)
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "rg-chatops-dev"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = (known after apply)
      + tags                          = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations-Dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-DevTeam"
          + "Purpose"     = "DistributedCache"
        }

      + redis_configuration {
          + aof_backup_enabled                     = false
          + authentication_enabled                 = (known after apply)
          + data_persistence_authentication_method = "SAS"
          + enable_authentication                  = true
          + maxclients                             = (known after apply)
          + maxfragmentationmemory_reserved        = (known after apply)
          + maxmemory_delta                        = (known after apply)
          + maxmemory_policy                       = "allkeys-lru"
          + maxmemory_reserved                     = (known after apply)
          + notify_keyspace_events                 = "KEx"
          + rdb_backup_enabled                     = true
          + rdb_backup_frequency                   = 15
          + rdb_backup_max_snapshot_count          = 1
          + rdb_storage_connection_string          = (sensitive value)
        }
    }

  # azurerm_role_assignment.kv_secrets_user_app_service must be replaced
-/+ resource "azurerm_role_assignment" "kv_secrets_user_app_service" {
      ~ id                               = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.KeyVault/vaults/chatops-kv-7j51clw8/providers/Microsoft.Authorization/roleAssignments/b78214a8-1f48-f6e0-a32d-0748f9893376" -> (known after apply)
      ~ name                             = "b78214a8-1f48-f6e0-a32d-0748f9893376" -> (known after apply)
      ~ principal_id                     = "1c83a1d0-b6ae-470d-9bde-cf0ed5fb3400" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_service_plan.chatops will be created
  + resource "azurerm_service_plan" "chatops" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "chatops-app-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-chatops-dev"
      + sku_name                     = "FC1"
      + tags                         = {
          + "Application" = "ChatOps"
          + "CostCenter"  = "IT-Operations-Dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ChatOps-DevTeam"
        }
      + worker_count                 = (known after apply)
    }

  # azurerm_storage_account.nsg_flow_logs will be updated in-place
  ~ resource "azurerm_storage_account" "nsg_flow_logs" {
      ~ allow_nested_items_to_be_public   = false -> true
        id                                = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Storage/storageAccounts/chatopsnsgflowb5xxtm3i"
        name                              = "chatopsnsgflowb5xxtm3i"
      ~ public_network_access_enabled     = false -> true
        tags                              = {
            "Application" = "ChatOps"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Purpose"     = "NSG Flow Logs"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.redis_backup will be created
  + resource "azurerm_storage_account" "redis_backup" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-chatops-dev"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Application" = "ChatOps"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Purpose"     = "RedisPersistence"
        }
    }

  # azurerm_subnet.app_subnet must be replaced
-/+ resource "azurerm_subnet" "app_subnet" {
      ~ default_outbound_access_enabled                = false -> true # forces replacement
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet" -> (known after apply)
        name                                           = "app-subnet"
      ~ private_endpoint_network_policies              = "Enabled" -> (known after apply)
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      - service_endpoint_policy_ids                    = [] -> null
        # (4 unchanged attributes hidden)

      ~ delegation {
            name = "app-service-delegation"

          ~ service_delegation {
              ~ actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.App/environments"
            }
        }
    }

  # azurerm_subnet.gateway_subnet must be replaced
-/+ resource "azurerm_subnet" "gateway_subnet" {
      ~ default_outbound_access_enabled                = false -> true # forces replacement
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/gateway-subnet" -> (known after apply)
        name                                           = "gateway-subnet"
      ~ private_endpoint_network_policies              = "Enabled" -> (known after apply)
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
        # (3 unchanged attributes hidden)
    }

  # azurerm_subnet.github_runners_subnet will be created
  + resource "azurerm_subnet" "github_runners_subnet" {
      + address_prefixes                               = [
          + "10.0.5.0/27",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-github-runners-dev"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-chatops-dev"
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "chatops-vnet"

      + delegation {
          + name = "aci-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.ContainerInstance/containerGroups"
            }
        }
    }

  # azurerm_subnet.redis_subnet will be created
  + resource "azurerm_subnet" "redis_subnet" {
      + address_prefixes                               = [
          + "10.0.4.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "chatops-redis-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-chatops-dev"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "chatops-vnet"
    }

  # azurerm_subnet_network_security_group_association.app_nsg_assoc must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "app_nsg_assoc" {
      ~ id                        = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet" -> (known after apply)
      ~ subnet_id                 = "/subscriptions/dc22d6d8-0495-4653-a69b-edfe16840f8e/resourceGroups/rg-chatops-dev/providers/Microsoft.Network/virtualNetworks/chatops-vnet/subnets/app-subnet" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # azurerm_subnet_network_security_group_association.gateway_nsg_assoc mu

... (output truncated)
```

</details>

*Pusher: @Copilot, Action: `pull_request`, Workflow: `Infrastructure - PR Validation`*